In [1]:
import sqlite3

#Creating a database.(If there is no database it will create one).
db= sqlite3.connect("my_testbase.db")

In [2]:
#Declare cursor
cursor= db.cursor()

In [3]:
#Create Table
cursor.execute("CREATE TABLE scores1(gender TEXT, student_id INT PRIMERY KEY, marks INT)")

In [4]:
#Insert records into the table.(single record inserting)

cursor.execute("INSERT INTO scores1(gender, student_id, marks) VALUES ('Male',100,55)")

#Save the records permenently. (If you don't commit, next time you will not see the records in the table)
db.commit()

#Counts of records inserted.
print(cursor.rowcount,"Records inserted")

1 Records inserted

In [5]:
cursor.execute("INSERT INTO scores1(gender, student_id, marks) VALUES ('Female',102,68),('Female',103,60)")
db.commit()

#Count of records insterted.

print(cursor.rowcount,"Records inserted")

2 Records inserted

In [6]:
cursor.execute("SELECT * FROM scores1")

In [7]:
import pandas as pd

In [8]:
df= pd.DataFrame(cursor.fetchall())

df

        0    1   2
0    Male  100  55
1  Female  102  68
2  Female  103  60

In [9]:
#This code help us to fetch column names.

cursor.description

(('gender', None, None, None, None, None, None),
 ('student_id', None, None, None, None, None, None),
 ('marks', None, None, None, None, None, None))

In [10]:
df.columns= [x[0] for x in cursor.description]

df.head()

   gender  student_id  marks
0    Male         100     55
1  Female         102     68
2  Female         103     60